### 결측치 처리

In [2]:
import pandas as pd
import numpy as np

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., None, None], [None, None, None], [None, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned = data.dropna() #default: NA를 하나라도 포함하는 로우를 제외

In [10]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how = 'all') #모두 NA값인 로우만 제외

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [24]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [3]:
df = pd.DataFrame(np.random.randn(7,3))

In [6]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.816033       NaN       NaN
1  0.222522       NaN       NaN
2 -0.671932       NaN  1.507681
3 -1.446724       NaN -0.829500
4 -1.352612 -0.018718  0.269067
5 -0.404272 -0.102355  1.033881
6 -0.534850  1.313627 -0.673805

In [9]:
df.dropna()

          0         1         2
4 -1.352612 -0.018718  0.269067
5 -0.404272 -0.102355  1.033881
6 -0.534850  1.313627 -0.673805

In [11]:
df.dropna(thresh = 2) #이상값이 있는 row만 보기 위해

          0         1         2
2 -0.671932       NaN  1.507681
3 -1.446724       NaN -0.829500
4 -1.352612 -0.018718  0.269067
5 -0.404272 -0.102355  1.033881
6 -0.534850  1.313627 -0.673805

In [12]:
df.fillna(0)

          0         1         2
0 -0.816033  0.000000  0.000000
1  0.222522  0.000000  0.000000
2 -0.671932  0.000000  1.507681
3 -1.446724  0.000000 -0.829500
4 -1.352612 -0.018718  0.269067
5 -0.404272 -0.102355  1.033881
6 -0.534850  1.313627 -0.673805

In [14]:
df.fillna({1:0.5, 2:0}) #각 컬럼마다 다른 값을 채울 수도 있음

          0         1         2
0 -0.816033  0.500000  0.000000
1  0.222522  0.500000  0.000000
2 -0.671932  0.500000  1.507681
3 -1.446724  0.500000 -0.829500
4 -1.352612 -0.018718  0.269067
5 -0.404272 -0.102355  1.033881
6 -0.534850  1.313627 -0.673805

In [16]:
_ = df.fillna(0, inplace = True) #fillna는 새로운 객체 반환, 그러나 inplace 옵션으로 기존 객체 변경 가능

In [20]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  0.856069  0.418546  1.189576
1 -1.298227  0.038802  1.029906
2  1.544810       NaN -0.034244
3 -0.917719       NaN  1.180799
4 -0.648790       NaN       NaN
5  0.970137       NaN       NaN

In [21]:
df.fillna(method = 'ffill')

          0         1         2
0  0.856069  0.418546  1.189576
1 -1.298227  0.038802  1.029906
2  1.544810  0.038802 -0.034244
3 -0.917719  0.038802  1.180799
4 -0.648790  0.038802  1.180799
5  0.970137  0.038802  1.180799

### 데이터 변형

In [23]:
data = pd.DataFrame({'k1': ['one', 'two']*3 + ['two'],
                    'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [24]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
data.drop_duplicates() #duplicated 배열이 FALSE인 dataFrame 반환

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
data['v1'] = range(7)
data.drop_duplicates(['k1']) #k1 컬럼을 기반으로 중복 걸러냄

    k1  k2  v1
0  one   1   0
1  two   1   1

In [30]:
data.drop_duplicates(['k1', 'k2'], keep='last') #마지막에 발견된 값 반환

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [32]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'Pastrami', 'honey ham', 'nova lox'], 
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     Pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [35]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'cow',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [39]:
lowercased = data['food'].str.lower()
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     cow
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     Pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [42]:
data['food'].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     cow
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     Pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

#### 값 치환하기

In [43]:
data.replace(-999, np.nan)

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     cow
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     Pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
data.replace([-999, -1000], np.nan)

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     cow
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     Pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [45]:
data.replace([-999, -1000], [np.nan, 0])

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     cow
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     Pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [46]:
data.replace({-999: np.nan, -1000: 0})

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     cow
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     Pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

#### 축 색인 이름 바꾸기

In [55]:
data = pd.DataFrame(np.arange(12).reshape((3,4)), index = ['Ohio', 'Colorado', 'New York'], columns = ['one', 'two', 'three', 'four'])

In [48]:
transform = lambda x: x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [49]:
data.index = data.index.map(transform)

In [58]:
data.rename(index = str.title, columns = str.upper) #원래 객체를 변경하지 않고 새로운 객체를 생성하려면 rename method, inplace 옵션도 가능

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

#### 개별화 양자화

In [59]:
ages = [20, 22, 25,27, 21, 23, 37, 31, 61, 45, 41, 32]

In [60]:
bins = [18, 25, 35, 60, 100]

In [63]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [65]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [66]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [67]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [70]:
pd.cut(ages, [18, 26, 36, 61, 100], right = False) # 범위를 ( ]로 변경

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [73]:
group_names =  ['Youth', 'YongAdult', 'MiddleAged', 'Senior'] #그룹의 이름을 직접 넘김
pd.cut(ages, bins, labels = group_names)

[Youth, Youth, Youth, YongAdult, Youth, ..., YongAdult, Senior, MiddleAged, MiddleAged, YongAdult]
Length: 12
Categories (4, object): [Youth < YongAdult < MiddleAged < Senior]

In [76]:
data = np.random.rand(20)
pd.cut(data, 4, precision = 2) #그룹 개수를 지정해 자동으로 균등한 길이 계산, 소수점 아래 2자리

[(0.24, 0.43], (0.62, 0.81], (0.24, 0.43], (0.043, 0.24], (0.043, 0.24], ..., (0.43, 0.62], (0.043, 0.24], (0.24, 0.43], (0.043, 0.24], (0.043, 0.24]]
Length: 20
Categories (4, interval[float64]): [(0.043, 0.24] < (0.24, 0.43] < (0.43, 0.62] < (0.62, 0.81]]

In [79]:
data = np.random.randn(1000) #정규분포
cats = pd.qcut(data, 4) #표본 변위치를 기반으로 4분위로 분류, qcut은 적당히 같은 크기의 그룹으로 나눌 수 있음
cats

[(-0.704, 0.0105], (0.0105, 0.672], (-3.481, -0.704], (-0.704, 0.0105], (-0.704, 0.0105], ..., (0.672, 3.224], (0.0105, 0.672], (0.672, 3.224], (-0.704, 0.0105], (-0.704, 0.0105]]
Length: 1000
Categories (4, interval[float64]): [(-3.481, -0.704] < (-0.704, 0.0105] < (0.0105, 0.672] < (0.672, 3.224]]

In [81]:
pd.value_counts(cats)

(0.672, 3.224]      250
(0.0105, 0.672]     250
(-0.704, 0.0105]    250
(-3.481, -0.704]    250
dtype: int64

#### 이상치 처리 ( 특잇값 찾기 & 제외 )

In [83]:
data = pd.DataFrame(np.random.randn(1000,4))

In [85]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.022073     0.037752     0.002401     0.036027
std       1.003287     0.986033     1.015828     1.011436
min      -3.584422    -3.622035    -3.248787    -3.193303
25%      -0.668064    -0.608773    -0.644224    -0.644061
50%      -0.009519     0.059831     0.019793     0.048260
75%       0.659401     0.693012     0.669848     0.688296
max       3.273501     3.330300     4.113870     3.025316

In [87]:
col = data[2]
col[np.abs(col) > 3]

81     3.018050
116   -3.248787
124    4.113870
203   -3.204327
304   -3.108180
522    3.272346
967   -3.055134
Name: 2, dtype: float64

In [89]:
data[(np.abs(data) > 3).any(1)] #절대값 3 초과하는 모든 로우 선택 => any 옵션 이용

            0         1         2         3
81   1.776476  1.443736  3.018050 -0.339092
116  0.236314 -1.444984 -3.248787  0.847973
124  0.672048 -0.356766  4.113870  0.037717
203  1.751526 -0.112387 -3.204327 -0.784635
295 -0.676619 -1.030171  0.325598  3.025316
304  0.351410  1.113405 -3.108180  0.009625
357  3.273501  1.087637 -0.410190  0.000463
507  1.541940  3.060073  0.157682 -1.039034
522  1.334499  1.275463  3.272346 -1.072840
526 -1.050029  3.201116  1.306062  0.915758
687  1.430812  3.330300 -1.041607 -0.892920
688  0.699969 -3.622035 -0.106053 -1.075533
782 -0.540389  3.160811  2.128659  0.550927
801 -3.584422  1.950973 -0.044150  0.053908
894 -0.074531 -0.391369 -1.309903 -3.193303
967  0.692193  0.457726 -3.055134 -1.891603

In [90]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [91]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.021762     0.037622     0.001613     0.036195
std       1.000514     0.981555     1.009127     1.010762
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.668064    -0.608773    -0.644224    -0.644061
50%      -0.009519     0.059831     0.019793     0.048260
75%       0.659401     0.693012     0.669848     0.688296
max       3.000000     3.000000     3.000000     3.000000

In [92]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0 -1.0 -1.0 -1.0
2  1.0  1.0 -1.0 -1.0
3  1.0  1.0 -1.0  1.0
4 -1.0  1.0 -1.0  1.0

#### 치환과 임의 샘플링

In [93]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [94]:
sampler = np.random.permutation(5)

In [95]:
sampler

array([1, 4, 3, 2, 0])

In [96]:
df.take(sampler) #ilokc 기반의 색인이나 take 함수에서 사용 가능

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [100]:
df.sample(n=3) #일부만 임의로 선택

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [102]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n = 10, replace = True)

#### 표시자/더미 변수 계산하기

In [106]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [107]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [109]:
dummies = pd.get_dummies(df['key'], prefix = 'key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

### 문자열 다루기

In [111]:
val = 'a, b, guido'
val.split(',')

['a', ' b', ' guido']

In [112]:
pieces = [x.strip() for x in val.split(',')]

In [113]:
pieces

['a', 'b', 'guido']

In [115]:
first, second, third = pieces
first + '::' + second  + '::' + third

'a::b::guido'

In [116]:
'::'.join(pieces)

'a::b::guido'

In [117]:
'guido' in val

True

In [118]:
val.index(',') #index는 찾지 못한 경우 에러 반환

1

In [119]:
val.find(':') #find는 찾지 못한 경우 -1 반환 -> 이거 이용

-1

In [120]:
val.count(',')

2